OpenFOAM/OpenFOAM-7/tutorials/lagrangian/simpleReactingParcelFoam/verticalChannel/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 4.5e-3;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }
    front
    {
        type            symmetryPlane;
    }
    inletCentral
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.007;
        k               k;
        value           uniform 4.5e-3;
    }
    inletSides
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.007;
        k               k;
        value           uniform 4.5e-3;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 4.5e-3;
    }
    walls
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;
    }
}


// ************************************************************************* //
